stratified_wave_tank_with_internal_wave_generator/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftWall
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    rightWall
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    bottomWall
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObject1
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObjectBottom1
    {
        type            oscillatingDisplacement;
        amplitude       (0.05 0 0);
        omega           0.3; 
        value           uniform (0 0 0);
    }

    floatingObject2
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObjectBottom2
    {
        type            oscillatingDisplacement;
        amplitude       (0.025 0 0);
        omega           0.3;
        value           uniform (0 0 0);
    }

    floatingObject3
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObjectBottom3
    {
        type            oscillatingDisplacement;
        amplitude       (0 0 0);
        omega           0.3; 
        value           uniform (0 0 0);
    }

    floatingObject4
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObjectBottom4
    {
        type            oscillatingDisplacement;
        amplitude       (-0.025 0 0);
        omega           0.3; 
        value           uniform (0 0 0);
    }

    floatingObject5
    {
        type            fixedNormalSlip;
        n               (-1 0 0);
    }

    floatingObjectBottom5
    {
        type            oscillatingDisplacement;
        amplitude       (-0.05 0 0);
        omega           0.3; 
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            zeroGradient;   
    }

}

// ************************************************************************* //
