stratified_wave_tank_with_internal_wave_generator/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 0.2 0)
    (0 0.2 0)
    (0 0 0.6)
    (3 0 0.6)
    (3 0.2 0.6)
    (0 0.2 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 2 120) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    frontAndBack
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    floatingObject1
    {
        type wall;
        faces ();
    }
    floatingObject2
    {
        type wall;
        faces ();
    }
    floatingObject3
    {
        type wall;
        faces ();
    }
    floatingObject4
    {
        type wall;
        faces ();
    }
    floatingObject5
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
