stratified_wave_tank_with_internal_wave_generator/system/topoSetDict-selectBottom3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    floatingObjectBottom3;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   floatingObject3;
        }
    }

    {
        name    floatingObjectBottom3;
        type    faceSet;
        action  subset;
        source  normalToFace;
        sourceInfo
        {
            normal (-1 0 0);     // Vector
            cos     0.01;       // Tolerance (max cos of angle)
        }
    }
);

// ************************************************************************* //
