stratified_wave_tank_with_internal_wave_generator/system/topoSetDict3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            // box (0.1 0.8 -100) (0.4 100 100);
            box (-100 -100 0.205) (0.2 100 0.3);
            // box (0.2 0.2 0.2) (0.4 0.4 0.4);
        }
    }

    {
        name    c2;
        type    cellSet;
        action  invert;
    }

    {
        name    f2FaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   leftWall;
        }
    }

    {
        name    f2FaceSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            // box (-100 0.9 -100) (0.2 100 100);
            box (-100 -100 0.2) (0.3 100 0.305);
            // box (0.2 0.2 0.2) (0.4 0.4 0.4);
        }
    }

    {
        name    f2;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet    f2FaceSet;
        }
    }

);


// ************************************************************************* //
